CSI API ETABS v1
cCaseResponseSpectrum.GetModalCase Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetModalCase(
	string Name,
	ref string ModalCase
)
Function GetModalCase (
	Name As String,
	ByRef ModalCase As String
) As Integer
Dim instance As cCaseResponseSpectrum
Dim Name As String
Dim ModalCase As String
Dim returnValue As Integer
returnValue = instance.GetModalCase(Name,
	ModalCase)
int GetModalCase(
	String^ Name,
	String^% ModalCase
)
abstract GetModalCase :
        Name : string *
        ModalCase : string byref -> int
Parameters
Name
Type: System.String
ModalCase
Type: System.String
Return Value
Type: Int32
See Also
Reference
cCaseResponseSpectrum Interface
ETABSv1 Namespace